/*******************************************************************************
*                 
*                 		       普中科技
--------------------------------------------------------------------------------
* 实 验 名		 : 串口实验
* 实验说明       : 在串口助手上选择波特率为9600，选择HEX发送和HEX显示，发送数据
					在串口上加1进行显示，参考里面图片设置
* 连接方式       : 
* 注    意		 : 	所用函数在头文件.c文件内
*******************************************************************************/

#include "public.h"
#include "usart.h"
#include "systick.h"
#include "led.h"


/****************************************************************************
* Function Name  : main
* Description    : Main program.
* Input          : None
* Output         : None
* Return         : None
****************************************************************************/
int main()
{		  
	usart_init();//串口1初始化
	LED_Init();
	while(1);	
}



